app/views/devise/registrations/edit.html.erb

      <%= f.label :city_id %>
      <%= f.collection_select :city_id, City.all, :id, :cities_name %>
---
SELECT "cities".* FROM "cities"  ORDER BY position ASC