app/views/devise/registrations/new.html.erb

SELECT "cities".* FROM "cities"
---
      <%= f.label :city_id %>
      <%= f.collection_select :city_id, City.all, :id, :cities_name %>