app/views/visitors/index.html.erb

<% end %>
<p><%= link_to 'Users:', users_path %> <%= User.count %> registered</p>
---
SELECT COUNT(*) FROM "users"