app/controllers/cities_controller.rb

  def index
	@cities = City.all
	@cities = City.paginate(:page => params[:page], :per_page => 2)
---
SELECT "cities".* FROM "cities"  ORDER BY position ASC
SELECT  "cities".* FROM "cities" LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "cities"

  def create
  	@city = City.new(city_params)
    if @city.save
---
INSERT INTO "cities" ("cities_name", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["cities_name", "Warsav"], ["short_name", "Wr"], ["created_at", "2015-02-19 12:42:26.573421"], ["updated_at", "2015-02-19 12:42:26.573421"]]

  def edit
    @city = City.find(params[:id])
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = ? LIMIT 1  [["id", 1]]