app/controllers/registrations_controller.rb

SELECT "cities".* FROM "cities"
---
	def new
		@cities = City.all

SELECT "cities".* FROM "cities"  ORDER BY position ASC
---
	def edit
		@cities = City.all